draft/reading-beauty-of-mathematics.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="CN" xml:lang="CN">
<head>
<!-- 2019-01-20 Sun 15:31 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>数学之美读书笔记</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Junahan" />
<meta name="keywords" content="数学 Mathematics" />
</head>
<body>
<div id="content">
<h1 class="title">数学之美读书笔记</h1>

<div id="outline-container-orge40154e" class="outline-2">
<h2 id="orge40154e"><span class="section-number-2">1</span> 概述</h2>
</div>

<div id="outline-container-org8c9f861" class="outline-2">
<h2 id="org8c9f861"><span class="section-number-2">2</span> 统计语言模型 (Statistical Language Model)</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgf81eb46" class="outline-3">
<h3 id="orgf81eb46"><span class="section-number-3">2.1</span> 语句的概率模型</h3>
<div class="outline-text-3" id="text-2-1">
<p>
一个句子是否合理，就看它的可能性大小如何。可能性可以使用概率来衡量。
假设句子 S 由一连串特定顺序排列的词 \(w_1,w_2,\cdots,w_n\) 组成，则句子 S 的概率为：
</p>

\begin{equation}
P(S)=P(w_1,w_2,\cdots,w_n)
\end{equation}

<p>
利用条件概率，\(S\) 的概率等于每个词出现的条件概率相乘，展开 \(P(w_1,w_2,...,w_n)\) ：
</p>

\begin{equation}
P(w_1,w_2,\cdots,w_n) 
= P(w_1)P(w_2|w_1)P(w_3|w_1,w_2) \cdots P(w_n|w_1,w_2,\cdots,w_{n-1})
\end{equation}

<p>
直接计算如上概率比较困难，借助于马尔可夫假设可以对如上条件概率进行估算。
</p>

<p>
假设任意一个词 \(w_i\) 出现的概率只同它前面一个词 \(w_{i-1}\) 有关，S 出现的概率就可以采用如下公式估算：
</p>

\begin{equation}
P(S)=P(w_1)P(w_2|w_1)P(w_3|w_2) \cdots P(w_i|w_{i-1}) \cdots P(w_n|w_{n-1})
\end{equation}

<p>
这种假设在数学上称之为马尔可夫假设。对应的统计语言模型就是二元模型 (Bigram Model) 。也可以假设一个词由前面 N - 1 个词决定，对应的模型称为 N 元模型。
</p>

<p>
要计算 P(S) ，接下来就需要估算条件概率 \(P(w_{i}|w_{i-1})\) 。根据定义：
</p>

\begin{equation}
P(w_{i}|w_{i-1}) = \frac{P(w_{i-1},w_{i})}{P(w_{i-1})}
\end{equation}

<p>
只要有足够的语料库 (Corpus)，就可以通过统计 \((w_{i-1},w_{i})\) 同时出现的次数及 \((w_{i-1})\) 单独出现的次数得到相应的频率：
</p>

\begin{equation}
f(w_{i-1},w_{i}) = \frac{\#(w_{i-1},w_{i})}{\#}
\end{equation}

\begin{equation}
f(w_{i-1}) = \frac{\#(w_{i-1})}{\#}
\end{equation}

<p>
根据大数定律，只要统计量足够，相对频率就等于概率：
</p>

\begin{equation}
P(w_{i-1},w_{i}) \approx \frac{\#(w_{i-1},w_{i})}{\#}
\end{equation}

\begin{equation}
P(w_{i-1}) \approx \frac{\#(w_{i-1})}{\#}
\end{equation}

<p>
因此：
</p>

\begin{equation}
P(w_{i}|w_{i-1}) \approx \frac{\#(w_{i-1},w_{i})}{\#(w_{i-1})}
\end{equation}
</div>
</div>

<div id="outline-container-orgb4f9703" class="outline-3">
<h3 id="orgb4f9703"><span class="section-number-3">2.2</span> 大数定律和条件概率估算</h3>
</div>

<div id="outline-container-org5d0d57e" class="outline-3">
<h3 id="org5d0d57e"><span class="section-number-3">2.3</span> 零概率问题和平滑方法</h3>
<div class="outline-text-3" id="text-2-3">
</div>
<div id="outline-container-orgdf44533" class="outline-4">
<h4 id="orgdf44533"><span class="section-number-4">2.3.1</span> Good-Turing Estimate</h4>
</div>

<div id="outline-container-org9bc5163" class="outline-4">
<h4 id="org9bc5163"><span class="section-number-4">2.3.2</span> Zipf 定律 (Zipf's Law)</h4>
</div>

<div id="outline-container-orgc8aabbe" class="outline-4">
<h4 id="orgc8aabbe"><span class="section-number-4">2.3.3</span> 卡茨退避法 (Katz backoff)</h4>
</div>
</div>
</div>

<div id="outline-container-orgf395a7f" class="outline-2">
<h2 id="orgf395a7f"><span class="section-number-2">3</span> <span class="todo TODO">TODO</span> 马尔可夫链<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup>和隐含马尔可夫模型</h2>
<div class="outline-text-2" id="text-3">
<p>
马尔可夫链
</p>
</div>

<div id="outline-container-orge360d1e" class="outline-3">
<h3 id="orge360d1e"><span class="section-number-3">3.1</span> 马尔可夫链</h3>
</div>

<div id="outline-container-org7e5889f" class="outline-3">
<h3 id="org7e5889f"><span class="section-number-3">3.2</span> 隐含马尔可夫模型</h3>
</div>
</div>

<div id="outline-container-org2713dba" class="outline-2">
<h2 id="org2713dba"><span class="section-number-2">4</span> 信息的度量</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orga83d908" class="outline-3">
<h3 id="orga83d908"><span class="section-number-3">4.1</span> 香农信息熵 (Entropy)</h3>
<div class="outline-text-3" id="text-4-1">
<p>
信息熵（Entropy）用于度量信息的不确定性。信息熵由如下公式定义：
</p>

\begin{equation}
H(X)=-\sum\limits_{x\in X}P(x)logP(x)
\end{equation}
</div>
</div>

<div id="outline-container-org5e884ca" class="outline-3">
<h3 id="org5e884ca"><span class="section-number-3">4.2</span> 条件熵 (Conditional Entropy)</h3>
<div class="outline-text-3" id="text-4-2">
\begin{equation}
H(X|Y) = -\sum\limits_{x\in X,y\in Y}P(x,y)logP(x|y)
\end{equation}
</div>
</div>

<div id="outline-container-orgd8db9bc" class="outline-3">
<h3 id="orgd8db9bc"><span class="section-number-3">4.3</span> 不等式</h3>
<div class="outline-text-3" id="text-4-3">
<p>
可以证明如下不等式成立：
</p>

<p>
\[H(X) \ge H(X|Y)\]
</p>

<p>
该不等式表明，多了 Y 的信息后，关于 X 的不确定性下降了！如果 Y 和 X 无关，则等号成立。
</p>
</div>
</div>

<div id="outline-container-orgd84983a" class="outline-3">
<h3 id="orgd84983a"><span class="section-number-3">4.4</span> 互信息 (Mutual Information)</h3>
<div class="outline-text-3" id="text-4-4">
<p>
假定两个随机事件 X 和 Y ，他们的互信息定义如下：
</p>

<p>
\[I(X;Y) = \sum\limits_{x\in x,y\in Y}P(x,y)log\frac{P(x,y)}{P(x)P(y)}\]
</p>

<p>
互信息实际上就是随机事件 X 的熵和 已知 Y 条件下的条件熵的差异：
</p>

<p>
\[I(X;Y) = H(X) - H(X|Y)\]
</p>

<p>
\[I(X;Y) \in [0, min(H(X), H(Y))]\]
</p>

<p>
当 X 和 Y 完全相关时：\(I(X;Y) = H(X)\) 且 \(H(X) = H(Y)\)
</p>

<p>
在自然语言处理中，两个随机事件，或者语言特征的互信息是很容易计算的。只要有足够的语料，就不难估算互信息公式中的 P(X,Y) ，P(X) 和 P(Y) 三个概率，进而计算互信息。使用互信息可以很简单且有效的解决机器翻译中词义的二义性 (Ambiguation) 问题。
</p>
</div>
</div>

<div id="outline-container-org6ca3e3c" class="outline-3">
<h3 id="org6ca3e3c"><span class="section-number-3">4.5</span> 相对熵（Relative Entropy）</h3>
<div class="outline-text-3" id="text-4-5">
<p>
相对熵有时又成为交叉熵，用于衡量相关性，不同于互信息，相对熵用于衡量两个取值为正数的函数的相似性，它的定义如下：
</p>

<p>
\[KL(f(x)||g(x)) = \sum\limits_{x\in X}f(x)log\frac{f(x)}{g(x)}\]
</p>

<p>
相对熵的三条结论：
</p>
<ol class="org-ol">
<li>对于两个完全相同的函数，他们的相对熵等于零。</li>
<li>相对熵越大，两个函数差异越大；反之，相对熵越小，两个函数差异越小。</li>
<li>对于概率分布或者概率密度函数，如果取值均大于零，相对熵可以度量两个随机分布的差异性。</li>
</ol>

<p>
需要注意的是，相对熵是不对称的，即
</p>

<p>
\[KL(f(x)||g(x)) \neq KL(g(x)||f(x))\]
</p>

<p>
相对熵在自然语言处理中的应用：
</p>
<ul class="org-ul">
<li>衡量两个常用词在不同文本中的概率分布，看他们是否同义。</li>
<li>利用相对熵还可以得到信息检索中最重要的一个概念：词频率-逆向文档频率 (TF-IDF)。</li>
</ul>
</div>
</div>

<div id="outline-container-org16c21f5" class="outline-3">
<h3 id="org16c21f5"><span class="section-number-3">4.6</span> 信息熵在语言模型中的应用</h3>
</div>
</div>

<div id="outline-container-org65f9ab6" class="outline-2">
<h2 id="org65f9ab6"><span class="section-number-2">5</span> <span class="todo TODO">TODO</span> 搜索引擎技术</h2>
<div class="outline-text-2" id="text-5">
<p>
搜索引擎工作原理其实非常简单，建立一个搜索引擎需要做几件事：
</p>
<ul class="org-ul">
<li>自动下载尽可能多的网页；</li>
<li>建立快速有效的索引；</li>
<li>根据相关性对网页进行公平准确的排序；</li>
</ul>

<p>
搜索产品可以提炼成下载、索引和排序这三种基本的服务。
</p>
</div>

<div id="outline-container-orgee47d93" class="outline-3">
<h3 id="orgee47d93"><span class="section-number-3">5.1</span> 布尔代数</h3>
<div class="outline-text-3" id="text-5-1">
<p>
布尔运算是针对二进制的简单运算，简单且快速。
</p>

<p>
搜索引擎本质上是在基于索引和关键字做简单的布尔运算。
</p>
</div>
</div>

<div id="outline-container-orgf47b434" class="outline-3">
<h3 id="orgf47b434"><span class="section-number-3">5.2</span> 索引</h3>
<div class="outline-text-3" id="text-5-2">
<p>
最简单的索引结构是用一个很长的二进制数表示一个关键字是否出现在每篇文献中。有多少文献，就有多少位数，每一位对应一片文献，1 代表相应的文献有这个关键字，0 代表没有。当然，由于这个二进制数中的绝大多数位数都是零，因此只需要记录那些等于 1 的位数即可。于是，搜索引擎的索引就是一张大表：表的每一行对应一个关键词，而每一个关键词后面跟着一组数字，是包含该关键词的文献序号。
</p>

<p>
搜索引擎会多所有词进行索引，这在工程上极具挑战性 - 数量巨大：
</p>

<p>
假设互联网网页的数量级是 100 亿 ($10<sub>10</sub>) 个，词汇的大小是 30 万，那么这个索引的大小就是 100 亿 * 30 万 = 3，000 万亿的级别，就算是考虑到压缩，也在 30 万亿级别。这还不包含需要存储的额外信息。
</p>

<p>
解决的方案：
</p>
<ul class="org-ul">
<li>将索引分成很多份 (Shards) 分别存储在不同的服务器上，查询任务也被分发到众多服务器上并行处理，并吧结果合并处理返回给客户。</li>
<li>根据网页的重要性、质量和访问的频率建立常用和不常用等不同级别的索引等以降低对资源的要求。</li>
</ul>
</div>
</div>

<div id="outline-container-org19694cc" class="outline-3">
<h3 id="org19694cc"><span class="section-number-3">5.3</span> 图论和网络爬虫</h3>
<div class="outline-text-3" id="text-5-3">
<p>
网络爬虫实质上就是运用图论中的遍历 (Traverse) 算法下载整个互联网。挑战在于如何快速有效的下载整个互联网。
</p>
</div>

<div id="outline-container-org631cb34" class="outline-4">
<h4 id="org631cb34"><span class="section-number-4">5.3.1</span> 图论</h4>
</div>

<div id="outline-container-orgaad761b" class="outline-4">
<h4 id="orgaad761b"><span class="section-number-4">5.3.2</span> 构建网络爬虫的工程要点</h4>
<div class="outline-text-4" id="text-5-3-2">
<ul class="org-ul">
<li>BFS 还是 DFS ?
<ul class="org-ul">
<li>任务调度系统 (Scheduler) 需要考虑网页的重要性以及下载效率等因素以排定优先级。</li>
<li>整体而言，工程上，BFS 成分多一些。</li>
</ul></li>
<li>页面的分析和 URL 的提取 - 主要是现代网页大量使用脚本语言 (JavaScript) 且很多不规范，需要能够成功的解析和运行这些脚本才能够找到其中的 URL。</li>
<li>防止网页重复下载 - 采用散列表存储已经下载的网页，但需要维护高效的散列表以消除性能瓶颈。
<ul class="org-ul">
<li>明确每台下载服务器分工 - 根据 URL 分工，避免过多的判重。</li>
<li>在明确分工基础上，对 URL 判重做批量处理。</li>
</ul></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgeb031bb" class="outline-3">
<h3 id="orgeb031bb"><span class="section-number-3">5.4</span> Google PageRank</h3>
<div class="outline-text-3" id="text-5-4">
<p>
对于特定的查询，搜索结果的排名主要取决于两组信息：关于网页的质量信息 (Quality)；以及这个查询与网页内容的相关性信息 (Relevance)。PageRank 算法是衡量网页质量的算法。
</p>

<p>
PageRank 的核心思想：
</p>
<ul class="org-ul">
<li>如果一个网页被很多其他网页所链接，说明它受到普遍的承认和信赖，那么它的排名就高。</li>
<li>网页排名高的网站贡献的链接权重大。</li>
</ul>

<p>
这个算法要解决两个难题：
</p>
<ul class="org-ul">
<li>计算网页排名的过程中需要用到网页本身的排名，通过把该问题转变成一个二维矩阵相乘，假设初始排名相同，采用迭代的方式收敛至真实排名来解决该问题，理论上可以证明无论初始值如何选择，算法都能保证网页皮阿明的估计值能够收敛到排名的真实值。</li>
<li>工程实现上，二维矩阵具有上百亿亿的量级，计算量巨大，PageRank 算法利用稀疏矩阵计算技巧解决该工程问题。</li>
</ul>
</div>
