org/reading-beauty-of-mathematics.org
*** PageRank 计算方法
假定向量

\begin{equation}
B = (b_{1},b_{2}, \cdots ,b_{N})^{T}
\end{equation}

为 N 个网页的排名。矩阵

\begin{equation}
A = \\
\begin{bmatrix}
a_{11}&\cdots&a_{1n}&\cdots&a_{1M}\\
\cdots& & & &\cdots\\
a_{m1}&\cdots&a_{mn}&\cdots&a_{mM}\\
\cdots& & & &\cdots\\
a_{M1}&\cdots&a_{Mn}&\cdots&a_{MM}
\end{bmatrix}
\end{equation}

为网页之间的链接数目，其中 $a_{mn}$ 代表地 m 个网页指向第 n 个网页的链接数。A 是已知，B 未知，是我们要计算的。

假定 $B_{i}$ 是第 i 次迭代的结果，那么

\begin{equation}
B_{i} = A \cdot B_{i-1}
\end{equation}

初始假设：所有网页排名均为 1/N，即

$$B_{0} = \left(\frac{1}{N},\frac{1}{N},\cdots,\frac{1}{N}\right)$$

每次迭代，均可以计算出一个 $B_{i}$ ，可以证明 $B_{i}$ 最终会收敛于 B，此时：

$$B = B \times A$$

因此，当两次迭代的结果 $B_{i}$ 和 $B_{i-1}$ 之间的差异非常小，接近于零时，停止迭代运算，算法结束，一般而言，只要 10 次左右的迭代基本上就收敛了。

由于网页之间的链接数量相对于互联网的规模来说非常稀疏，因此计算网页的排名也需要对零概率或者小概率事件进行平滑处理。网页排名是一个一维向量，对它的平滑处理智能利用一个小的常数 $\alpha$ 。

\begin{equation}
B_{i} = \left[\frac{\alpha}{N} \cdot I + (1 - \alpha)A\right] \cdot B_{i-1}
\end{equation}

其中 $N$ 是互联网网页的数量，$\alpha$ 是一个（较小的）常数，$I$ 是单位矩阵。

网页排名的计算主要是矩阵的相乘，这种计算很容易分解成许多小任务，在多台计算机上并行处理。例如，可以利用 Google 并行计算工具 MapReduce 进行并行计算。

** 如何确定网页和查询的相关性
今天，由于商业搜索引擎已经有了大量的用户点击数据，因此，对搜索相关性贡献最大的根据用户对常见搜索点击网页的结果得到的概率模型。

对于影响搜索引擎质量的诸多因素，除了用户点击数据以外，可以归纳为如下四大类：

1. 完备的索引。
2. 对网页质量的度量，比如 PageRank 就是解决这个问题的算法。
3. 用户偏好。
4. 确定网页和某个查询的相关性。

*** TF-IDF
TF-IDF 是搜索关键词权重的科学度量。

TF (Term Frequency / 单文本词频) 是关键词在文本中出现的次数除以文本总字数的商。度量网页和查询的相关性，一个简单的方法，就是直接使用各个关键词在网页中出现的总词频。如，一个查询短语包含 N 个关键词 $w_{1}, w_{2}, \cdots, w_{N}$ ，它们在一个特定网页中的词频分别是： $TF_{1}, TF_{2}, \cdots, TF_{N}$ 。那么，这个查询和该网页的相关性就是：

\begin{equation}
TF_{1} + TF_{2} + \cdots + TF_{N}
\end{equation}

这里假设每个词权重相同，但实际上，每个词对网页主题的贡献不同，例如，汉语中，“的”、“是” 等常用词，词频很高，但对主题几乎没有什么贡献，这些词称之为停止词 (Stop Word) 。更好的方法是为不同的关键词分配不同的权重。权重的设置满足如下条件：
1. 一个词预测主题的能力越强，权重越大，反之，权重越小。
2. 停止词的权重为零。

在信息检索中，使用最多的权重是 IDF (Inverse Document Frequency / 逆文本频率指数)，IDF 的定义如下：

\begin{equation}
IDF = log \left(\frac{D}{D_{w}} \right)
\end{equation}

其中，D 是全部网页数量，$D_{w}$ 是全部网页中，出现关键词 w 的网页数。

结合 TF 和 IDF ，度量网页和查询相关性的公式就是变成了关键词加权和

\begin{equation}
TF_{1} \cdot IDF_{1} + TF_{2} \cdot IDF_{2} + \cdots + TF_{N} \cdot IDF_{N}
\end{equation}

** TODO 搜索结果权威性
互联网上的内容众多，但很多内容并不可靠，PageRank 算法和网页相关性算法并不能解决内容权威性问题。

** 小结
有了如何下载网页、建立索引和计算度量网页质量的 PageRank 算法以及计算度量查询和网页相关性的 TF-IDF 算法，就可以搭建一个简单的搜素引擎了。就今天而言（2019 年 1 月），商业搜索引擎通过运营积累下来的用户点击数据，能够产生更好的网页质量和查询网页相关性模型，从而获得更好的网页排名。

* 有限状态机和动态规划
有限状态机和动态规划是地图和本地搜索的核心技术。智能手机的定位导航功能，有三项关键技术。

1. 利用卫星定位。
2. 地址的识别。
3. 根据用户输入的起点和终点，在地图上规划最短路线或者最快路线。

** 地址分析和有限状态机
地址的文法分析是上下文有关文法中相对简单的一种，因此有许多识别和分析方法，但最有效的是有限状态机。使用有限状态机识别地址，关键是要解决两个问题：

1. 通过一些有效的地址建立状态机；
2. 既定一个有效状态机，地址字串的匹配算法；

有了有限状态机后，就可以用它分析网页，找出网页中的地址部分，建立本地搜索的数据库。同样，也可以对用户输入的查询进行分析，挑出描述地址的部分。

为了解决地址不标准以及错别字问题，需要进行模糊匹配，并给出一个字串为正确地址的可能性，科学家们提出了基于概率的有限状态机。

** 导航和动态规划
全球导航的关键算法是计算机科学图论中的动态规划 (Dynamic Programming) 算法。

** FST[fn:2] and WFST[fn:3] Library

*** AT&T FSM Library
The FSM library was developed by Mehryar Mohri, Fernando Peirera and Michael Riley when the authors were working at AT&T Labs - Research External site. The library is available as binaries only for non-commercial use.

The FSM library and the [[http://www.openfst.org/twiki/bin/view/FST/WebHome][OpenFst]] library share the same textual representation.

项目已经关闭，建议使用 [[http://www.openfst.org/twiki/bin/view/FST/WebHome][OpenFst]] library。

*** OpenFst[fn:4] Library
[[http://www.openfst.org/twiki/bin/view/FST/WebHome][OpenFst]] is a library for constructing, combining, optimizing, and searching weighted finite-state transducers (FSTs). Weighted finite-state transducers are automata where each transition has an input label, an output label, and a weight. The more familiar finite-state acceptor is represented as a transducer with each transition's input and output label equal. Finite-state acceptors are used to represent sets of strings (specifically, regular or rational sets); finite-state transducers are used to represent binary relations between pairs of strings (specifically, rational transductions). The weights can be used to represent the cost of taking a particular transition.

** 小结

* 余弦定理和新闻分类
计算机并不能读懂新闻，而是新闻变成一组可以计算的数字 (向量)，然后再设计算法来计算任意两篇新闻（或者任意两段文本）之间的相似性。

** 新闻的特征向量
新闻由词构成，相同的新闻用词类似，不同的新闻用词个不相同。虚词（如得、地、的）对主题贡献不大，实词更加重要。新闻的特征向量 (Feature Vector) 就是将一篇新闻中的所有实词，计算出他们的 TF-IDF 值，并按照词汇表的位置依次排列，就得到一个描述新闻的特征向量。

| 单词编号 | TF-IDF 值 | 汉字词 |
|        1 |         0 | 阿     |
|        2 |    0.0034 | 啊     |
|        3 |         0 | 阿斗   |
|        4 |   0.00052 | 阿姨   |
|      ... |       ... | ...    |
|      789 |     0.034 | 服装   |
|      ... |       ... | ...    |
|    64000 |     0.075 | 做作     |

假定词汇表的数量是 N ，则每篇新闻都可以表示为一个 N 维的向量。有了新闻的特征向量，计算机就可以计算出新闻的形似程度。

** 向量距离的度量
向量的夹角是衡量两个向量距离的度量。而要计算两个向量的夹角，则需要用到余弦定理。

* 信息指纹及其应用
** 信息指纹
任何一段信息都可以对应一个不太长的随机数，作为区分两端信息的指纹。常用的信息指纹算法有 =MD5= ，以及 =SHA-1= 。

信息指纹可用于：
- 集合相同的判定；
- 判定集合基本相同 - 例如通过对比部分关键信息的指纹，相似哈希算法可用于这个目的；

** 相似哈希 (Simhash)
相似哈希是一种特殊的信息指纹，是 Moses Charikar[fn:5] 在 2002 年提出，Google 在网页爬虫中使用了该方法并把结果发表在 WWW [fn:6] 会议上。相似哈希的特点是，如果两段信息的形似哈希相差越小，这段信息的形似性就越高。如果它们的形似哈希相同，则它们必定相同。如果只有少数权重小的词不同，其余词都相同，几乎可以肯定它们的相似哈希也会相同。

相似哈希不仅可以用于判定两个网页的形似行，也可以适用于其他类似场景，如视频匹配。视频匹配的两个核心技术是关键帧提取和特征提取。关键帧对于视频的重要性就如同主题词对于新闻的重要性一样，处理视频首先是要找到关键帧，接下来就是要用一组信息指纹来表示这些关键帧，有了这些信息指纹以后，视频匹配就类似于比较两个集合元素是否相同了。这种算法可以被用于解决视频盗版问题。

** 读者扩展

