org/reading-beauty-of-mathematics.org
* TODO 最大熵模型
最大熵原理指出，对于一个随机事件的概率分布进行预测时，我们的预测应当满足全部已知条件，而对于未知的情况不做任何主观假设。在这种情况下，概率分布最均匀，预测的风险最小。由于这个概率分布的信息熵最大，人们把这种模型叫做”最大熵模型”。

最大熵模型应用广泛：
- 自然语言处理，如词性标注、句法分析、语言模型和机器翻译等；
- 网页的排序；
- 证劵自动化交易等；

假定搜索网页排序需要考虑 20 种特征，$\{x_1,x_2, \cdots ,x_{20}\}$ , 待排序网页是 $d$ ，那么：

\begin{equation}
P(d|x_1,x_2, \cdots ,x_{20}) 
= \frac{1}{Z(x_1,x_2, \cdots ,x_{20})} e^{ \lambda_{1}(x_{1},d) + \lambda_{2}(x_{2},d) + \cdots + \lambda_{20}(x_{20},d) }
\end{equation}

归一化因子：
\begin{equation}
Z(x_{1},x_{2}, \cdots ,x_{20}) = 
\sum\limits_{d} e^{\lambda_{1}(x_{1},d)+\lambda_{2}(x_{2},d)+ \cdots + \lambda_{20}(x_{20},d)}
\end{equation}

** 最大熵模型的训练算法
*** GIS[fn:7]
*** IIS[fn:8]
*** WuJun[fn:9]

** 小结
最大熵模型可以将各种信息整合到一个统一的模型中。它有很多良好的特性：从形式上看，它非常简单，非常优美；从效果上看，它是唯一一种既能满足各个信息源的限制条件，又能保证平滑性 (Smooth) 的模型。其应用十分广泛，但计算量巨大。

** TODO 读者扩展

* TODO 拼音输入法的数学原理
* TODO 贝叶斯网络
* Footnotes

[fn:9] Wu, J, Maximum entropy language modeling with non-local dependencies, Ph.D dissertation, www.cs.jhu.edu/~junwu/publications/dissertation.pdf,2002.

[fn:8] Della Pietra, S., Della Pietra, V. &Lafferty, J. Inducing Features of Random Fields, IEEETrans. On Pattern Analysis and Machine Intelligence. vol.19, No.4, pp280-393, 1997

[fn:7] Csiszar, I. A Geometric Interpretation of Darroch and Ratcliff's Generalized Iterative Scaling. The Annals of Statistics. Vol. 17, No.3, pp.1409-1413. 1989.

[fn:6] Gurmeet Singh Manku, Arvind Jain and Anish Das Sarma, Detecting Near-Duplicates for Web Crawling, WWW2007, 2007.

[fn:5] Moses Charikar, Similarity Estimation Techniques from Rounding Algorithms, Proceedings of the 34th Annual ACM Symposium on Theory of Computing, 2002.

[fn:4] OpenFst, http://www.openfst.org/twiki/bin/view/FST/WebHome

[fn:3] WFST Algorithms, http://www.gavo.t.u-tokyo.ac.jp/~novakj/wfst-algorithms.pdf

[fn:2] FST ,https://en.wikipedia.org/wiki/Finite-state_transducer

[fn:1] 马尔可夫链，https://zh.wikipedia.org/wiki/%E9%A9%AC%E5%B0%94%E5%8F%AF%E5%A4%AB%E9%93%BE
