draft/reading-beauty-of-mathematics.html

<div id="outline-container-orge06ee79" class="outline-3">
<h3 id="orge06ee79"><span class="section-number-3">8.3</span> 读者扩展</h3>
</div>
</div>

<div id="outline-container-org5b75cc2" class="outline-2">
<h2 id="org5b75cc2"><span class="section-number-2">9</span> <span class="todo TODO">TODO</span> 最大熵模型</h2>
<div class="outline-text-2" id="text-9">
<p>
最大熵原理指出，对于一个随机事件的概率分布进行预测时，我们的预测应当满足全部已知条件，而对于未知的情况不做任何主观假设。在这种情况下，概率分布最均匀，预测的风险最小。由于这个概率分布的信息熵最大，人们把这种模型叫做”最大熵模型”。
</p>

<p>
最大熵模型应用广泛：
</p>
<ul class="org-ul">
<li>自然语言处理，如词性标注、句法分析、语言模型和机器翻译等；</li>
<li>网页的排序；</li>
<li>证劵自动化交易等；</li>
</ul>

<p>
假定搜索网页排序需要考虑 20 种特征，\(\{x_1,x_2, \cdots ,x_{20}\}\) , 待排序网页是 \(d\) ，那么：
</p>

\begin{equation}
P(d|x_1,x_2, \cdots ,x_{20}) 
= \frac{1}{Z(x_1,x_2, \cdots ,x_{20})} e^{ \lambda_{1}(x_{1},d) + \lambda_{2}(x_{2},d) + \cdots + \lambda_{20}(x_{20},d) }
\end{equation}

<p>
归一化因子：
</p>
\begin{equation}
Z(x_{1},x_{2}, \cdots ,x_{20}) = 
\sum\limits_{d} e^{\lambda_{1}(x_{1},d)+\lambda_{2}(x_{2},d)+ \cdots + \lambda_{20}(x_{20},d)}
\end{equation}
</div>

<div id="outline-container-orge65c3cb" class="outline-3">
<h3 id="orge65c3cb"><span class="section-number-3">9.1</span> 最大熵模型的训练算法</h3>
<div class="outline-text-3" id="text-9-1">
</div>
<div id="outline-container-org8baa05e" class="outline-4">
<h4 id="org8baa05e"><span class="section-number-4">9.1.1</span> GIS<sup><a id="fnr.7" class="footref" href="#fn.7">7</a></sup></h4>
</div>
<div id="outline-container-org390c296" class="outline-4">
<h4 id="org390c296"><span class="section-number-4">9.1.2</span> IIS<sup><a id="fnr.8" class="footref" href="#fn.8">8</a></sup></h4>
</div>
<div id="outline-container-orgbb19c1d" class="outline-4">
<h4 id="orgbb19c1d"><span class="section-number-4">9.1.3</span> WuJun<sup><a id="fnr.9" class="footref" href="#fn.9">9</a></sup></h4>
</div>
</div>

<div id="outline-container-orge585880" class="outline-3">
<h3 id="orge585880"><span class="section-number-3">9.2</span> 小结</h3>
<div class="outline-text-3" id="text-9-2">
<p>
最大熵模型可以将各种信息整合到一个统一的模型中。它有很多良好的特性：从形式上看，它非常简单，非常优美；从效果上看，它是唯一一种既能满足各个信息源的限制条件，又能保证平滑性 (Smooth) 的模型。其应用十分广泛，但计算量巨大。
</p>
</div>
</div>

<div id="outline-container-orgcbb6e18" class="outline-3">
<h3 id="orgcbb6e18"><span class="section-number-3">9.3</span> <span class="todo TODO">TODO</span> 读者扩展</h3>
</div>
</div>

<div id="outline-container-orga52bb34" class="outline-2">
<h2 id="orga52bb34"><span class="section-number-2">10</span> 拼音输入法的数学原理</h2>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
马尔可夫链，<a href="https://zh.wikipedia.org/wiki/%E9%A9%AC%E5%B0%94%E5%8F%AF%E5%A4%AB%E9%93%BE">https://zh.wikipedia.org/wiki/马尔可夫链</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2">2</a></sup> <div class="footpara"><p class="footpara">
FST ,<a href="https://en.wikipedia.org/wiki/Finite-state_transducer">https://en.wikipedia.org/wiki/Finite-state_transducer</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.3" class="footnum" href="#fnr.3">3</a></sup> <div class="footpara"><p class="footpara">
WFST Algorithms, <a href="http://www.gavo.t.u-tokyo.ac.jp/~novakj/wfst-algorithms.pdf">http://www.gavo.t.u-tokyo.ac.jp/~novakj/wfst-algorithms.pdf</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.4" class="footnum" href="#fnr.4">4</a></sup> <div class="footpara"><p class="footpara">
OpenFst, <a href="http://www.openfst.org/twiki/bin/view/FST/WebHome">http://www.openfst.org/twiki/bin/view/FST/WebHome</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.5" class="footnum" href="#fnr.5">5</a></sup> <div class="footpara"><p class="footpara">
Moses Charikar, Similarity Estimation Techniques from Rounding Algorithms, Proceedings of the 34th Annual ACM Symposium on Theory of Computing, 2002.
</p></div></div>

<div class="footdef"><sup><a id="fn.6" class="footnum" href="#fnr.6">6</a></sup> <div class="footpara"><p class="footpara">
Gurmeet Singh Manku, Arvind Jain and Anish Das Sarma, Detecting Near-Duplicates for Web Crawling, WWW2007, 2007.
</p></div></div>

<div class="footdef"><sup><a id="fn.7" class="footnum" href="#fnr.7">7</a></sup> <div class="footpara"><p class="footpara">
Csiszar, I. A Geometric Interpretation of Darroch and Ratcliff's Generalized Iterative Scaling. The Annals of Statistics. Vol. 17, No.3, pp.1409-1413. 1989.
</p></div></div>

<div class="footdef"><sup><a id="fn.8" class="footnum" href="#fnr.8">8</a></sup> <div class="footpara"><p class="footpara">
Della Pietra, S., Della Pietra, V. &amp;Lafferty, J. Inducing Features of Random Fields, IEEETrans. On Pattern Analysis and Machine Intelligence. vol.19, No.4, pp280-393, 1997
</p></div></div>

<div class="footdef"><sup><a id="fn.9" class="footnum" href="#fnr.9">9</a></sup> <div class="footpara"><p class="footpara">
Wu, J, Maximum entropy language modeling with non-local dependencies, Ph.D dissertation, www.cs.jhu.edu/~junwu/publications/dissertation.pdf,2002.
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="date">Date: 2019-01-01</p>
<p class="author">Author: Junahan</p>
<p class="date">Created: 2019-01-20 Sun 15:31</p>
<p class="validation"></p>
</div>
</body>
</html>
